Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedBarLoad Methods
The AnalysisDecomposedBarLoad type exposes the following members.
Methods
Name | Description
Select
 Selects an analysis decomposed bar load.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
AnalysisDecomposedBarLoad Class
Tekla.Structures.Analysis Namespace